.. _postcode_userguide:

postcode Strings
============

Introduction
------------

The function :func:`clean_nl_postcode() <dataprep.clean.clean_nl_postcode.clean_nl_postcode>` cleans a column containing Dutch postal codes strings, and standardizes them in a given format. The function :func:`validate_nl_postcode() <dataprep.clean.clean_nl_postcode.validate_nl_postcode>` validates either a single postcode strings, a column of postcode strings or a DataFrame of postcode strings, returning `True` if the value is valid, and `False` otherwise.

postcode strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "2611ET"
* `standard`: postcode strings with proper whitespace in the proper places. Note that in the case of postcode, the compact format is the same as the standard one.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_nl_postcode()` and `validate_nl_postcode()`.

### An example dataset containing postcode strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "postcode": [
            'NL-2611ET',
            '26112 ET',
            'BE 428759497',
            'BE431150351',
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

       postcode                                           address
0     NL-2611ET                                     123 Pine Ave.
1      26112 ET                                           main st
2  BE 428759497                      1234 west main heights 57033
3   BE431150351                    apt 1 789 s maple rd manhattan
4   002 724 334                robie house, 789 north main street
5         hello         1111 S Figueroa St, Los Angeles, CA 90015
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NULL                                             hello

## 1. Default `clean_nl_postcode`

By default, `clean_nl_postcode` will clean postcode strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_nl_postcode
clean_nl_postcode(df, column = "postcode")

,postcode,address,postcode_clean
0,NL-2611ET,123 Pine Ave.,2611ET
1,26112 ET,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_nl_postcode(df, column = "postcode", output_format="standard")

,postcode,address,postcode_clean
0,NL-2611ET,123 Pine Ave.,2611ET
1,26112 ET,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_nl_postcode(df, column = "postcode", output_format="compact")

,postcode,address,postcode_clean
0,NL-2611ET,123 Pine Ave.,2611ET
1,26112 ET,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned postcode strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_nl_postcode(df, column="postcode", inplace=True)

  postcode_clean                                           address
0         2611ET                                     123 Pine Ave.
1            NaN                                           main st
2            NaN                      1234 west main heights 57033
3            NaN                    apt 1 789 s maple rd manhattan
4            NaN                robie house, 789 north main street
5            NaN         1111 S Figueroa St, Los Angeles, CA 90015
6            NaN  (staples center) 1111 S Figueroa St, Los Angeles
7            NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_nl_postcode(df, "postcode", errors="coerce")

,postcode,address,postcode_clean
0,NL-2611ET,123 Pine Ave.,2611ET
1,26112 ET,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [7]:
clean_nl_postcode(df, "postcode", errors="ignore")

,postcode,address,postcode_clean
0,NL-2611ET,123 Pine Ave.,2611ET
1,26112 ET,main st,26112 ET
2,BE 428759497,1234 west main heights 57033,BE 428759497
3,BE431150351,apt 1 789 s maple rd manhattan,BE431150351
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_nl_postcode()`

`validate_nl_postcode()` returns `True` when the input is a valid postcode. Otherwise it returns `False`.

The input of `validate_nl_postcode()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_nl_postcode()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_nl_postcode()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_nl_postcode
print(validate_nl_postcode("NL-2611ET"))
print(validate_nl_postcode("26112 ET"))
print(validate_nl_postcode('BE 428759497'))
print(validate_nl_postcode('BE431150351'))
print(validate_nl_postcode("004085616"))
print(validate_nl_postcode("hello"))
print(validate_nl_postcode(np.nan))
print(validate_nl_postcode("NULL"))

True
False
False
False
False
False
False
False

### Series

In [9]:
validate_nl_postcode(df["postcode"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: postcode, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_nl_postcode(df, column="postcode")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: postcode, dtype: bool

### Only DataFrame

In [11]:
validate_nl_postcode(df)

   postcode  address
0      True    False
1     False    False
2     False    False
3     False    False
4     False    False
5     False    False
6     False    False
7     False    False